happychriss/ChatGPT_ESP32S3_RealtimeSpeech/components/audio_stream_custom/i2s_stream_idf5_ics43434.c
/*
 * ESPRESSIF MIT License
 *
 * Copyright (c) 2024 <ESPRESSIF SYSTEMS (SHANGHAI) CO., LTD>
 *
 * Permission is hereby granted for use on all ESPRESSIF SYSTEMS products, in which case,
 * it is free of charge, to any person obtaining a copy of this software and associated
 * documentation files (the "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the Software is furnished
 * to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all copies or
 * substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 */

#include "audio_idf_version.h"
#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0))
#include <string.h>

#include "esp_log.h"

#include "audio_mem.h"
#include "esp_alc.h"
#include "i2s_stream.h"
#include "board_pins_config.h"

static const char *TAG = "I2S_STREAM_IDF5.x";

#define I2S_BUFFER_ALINED_BYTES_SIZE (12)

typedef struct i2s_stream {
    audio_stream_type_t type;
    i2s_stream_cfg_t    config;
    bool                is_open;
    bool                use_alc;
    void               *volume_handle;
    int                 volume;
    bool                uninstall_drv;
    i2s_port_t          port;
    int                 buffer_length;
    struct {
        char           *buf;
        int             buffer_size;
    } expand;
} i2s_stream_t;

struct i2s_key_slot_s {
    i2s_chan_handle_t       rx_handle;
    i2s_chan_handle_t       tx_handle;
    union {
        i2s_std_config_t    rx_std_cfg;
#if SOC_I2S_SUPPORTS_PDM_RX
        i2s_pdm_rx_config_t rx_pdm_cfg;
#endif // SOC_I2S_SUPPORTS_PDM_RX
#if SOC_I2S_SUPPORTS_TDM
        i2s_tdm_config_t    rx_tdm_cfg;
#endif // SOC_I2S_SUPPORTS_TDM
    };
    union {
        i2s_std_config_t    tx_std_cfg;
#if SOC_I2S_SUPPORTS_PDM_TX
        i2s_pdm_tx_config_t tx_pdm_cfg;
#endif // SOC_I2S_SUPPORTS_PDM_TX
#if SOC_I2S_SUPPORTS_TDM
        i2s_tdm_config_t    tx_tdm_cfg;
#endif // SOC_I2S_SUPPORTS_TDM
    };
    i2s_chan_config_t       chan_cfg;
    i2s_dir_t               dir;
    int                     i2s_refcount;
};

static void *s_i2s_tx_mutex[SOC_I2S_NUM];
static void *s_i2s_rx_mutex[SOC_I2S_NUM];

static struct i2s_key_slot_s i2s_key_slot[SOC_I2S_NUM];

#define i2s_safe_lock_create(lock) do {           \
    if (lock == NULL) {                           \
        lock = xSemaphoreCreateRecursiveMutex();  \
    }                                             \
} while (0)

#define i2s_safe_lock(lock) do {                       \
    if (lock) {                                        \
        xSemaphoreTakeRecursive(lock, portMAX_DELAY);  \
    }                                                  \
} while (0)

#define i2s_safe_unlock(lock) do {      \
    if (lock) {                         \
        xSemaphoreGiveRecursive(lock);  \
    }                                   \
} while (0)

static int i2s_driver_startup(audio_element_handle_t self, i2s_stream_cfg_t *i2s_cfg)
{
    esp_err_t ret = ESP_OK;
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(self);
    i2s_comm_mode_t i2s_mode = i2s_cfg->transmit_mode;
    int i2s_port = i2s_cfg->chan_cfg.id;
    board_i2s_pin_t board_i2s_pin = { 0 };
    get_i2s_pins(i2s_port, &board_i2s_pin);

    i2s_key_slot[i2s->port].chan_cfg.auto_clear = true;
    ret = i2s_new_channel(&i2s_key_slot[i2s->port].chan_cfg, i2s_key_slot[i2s->port].dir & I2S_DIR_TX ?  &i2s_key_slot[i2s->port].tx_handle : NULL,
                          i2s_key_slot[i2s->port].dir & I2S_DIR_RX ?  &i2s_key_slot[i2s->port].rx_handle : NULL);
    switch (i2s_mode) {
        case I2S_COMM_MODE_STD:
            if (i2s_key_slot[i2s->port].dir & I2S_DIR_TX) {
                memcpy(&i2s_key_slot[i2s->port].tx_std_cfg.gpio_cfg, &board_i2s_pin, sizeof(board_i2s_pin_t));
                ret |= i2s_channel_init_std_mode(i2s_key_slot[i2s->port].tx_handle, &i2s_key_slot[i2s->port].tx_std_cfg);
            }
            if (i2s_key_slot[i2s->port].dir & I2S_DIR_RX) {
                memcpy(&i2s_key_slot[i2s->port].rx_std_cfg.gpio_cfg, &board_i2s_pin, sizeof(board_i2s_pin_t));
                ret |= i2s_channel_init_std_mode(i2s_key_slot[i2s->port].rx_handle, &i2s_key_slot[i2s->port].rx_std_cfg);
            }
            break;
#if SOC_I2S_SUPPORTS_PDM
        case I2S_COMM_MODE_PDM:
#if SOC_I2S_SUPPORTS_PDM_RX
            if (i2s_key_slot[i2s->port].dir & I2S_DIR_RX) {
                i2s_key_slot[i2s->port].rx_pdm_cfg.gpio_cfg.clk = board_i2s_pin.bck_io_num;
                i2s_key_slot[i2s->port].rx_pdm_cfg.gpio_cfg.din = board_i2s_pin.data_in_num;
                ret |= i2s_channel_init_pdm_rx_mode(i2s_key_slot[i2s->port].rx_handle, &i2s_key_slot[i2s->port].rx_pdm_cfg);
            }
#endif // SOC_I2S_SUPPORTS_PDM_RX
#if SOC_I2S_SUPPORTS_PDM_TX
            if (i2s_key_slot[i2s->port].dir & I2S_DIR_TX) {
                i2s_key_slot[i2s->port].tx_pdm_cfg.gpio_cfg.clk = board_i2s_pin.bck_io_num;
                i2s_key_slot[i2s->port].tx_pdm_cfg.gpio_cfg.dout = board_i2s_pin.data_out_num;
                ret |= i2s_channel_init_pdm_tx_mode(i2s_key_slot[i2s->port].tx_handle, &i2s_key_slot[i2s->port].tx_pdm_cfg);
            }
#endif // SOC_I2S_SUPPORTS_PDM_TX
            break;
#endif // SOC_I2S_SUPPORTS_PDM

#if SOC_I2S_SUPPORTS_TDM
        case I2S_COMM_MODE_TDM:
            if (i2s_key_slot[i2s->port].dir & I2S_DIR_TX) {
                memcpy(&i2s_key_slot[i2s->port].tx_tdm_cfg.gpio_cfg, &board_i2s_pin, sizeof(board_i2s_pin_t));
                ret |= i2s_channel_init_tdm_mode(i2s_key_slot[i2s->port].tx_handle, &i2s_key_slot[i2s->port].tx_tdm_cfg);
            }
            if (i2s_key_slot[i2s->port].dir & I2S_DIR_RX) {
                memcpy(&i2s_key_slot[i2s->port].rx_tdm_cfg.gpio_cfg, &board_i2s_pin, sizeof(board_i2s_pin_t));
                ret |= i2s_channel_init_tdm_mode(i2s_key_slot[i2s->port].rx_handle, &i2s_key_slot[i2s->port].rx_tdm_cfg);
            }
            break;
#endif // SOC_I2S_SUPPORTS_TDM
        default:
            ESP_LOGE(TAG, "Invalid I2S transmit mode, %d", i2s_mode);
            ret = ESP_FAIL;
            break;
    }
    return ret;
}

