happychriss/ChatGPT_ESP32S3_RealtimeSpeech/components/audio_stream_custom/i2s_stream_idf5_ics43434.c
static esp_err_t i2s_driver_cleanup(i2s_stream_t *i2s, bool deep_cleanup)
{
    esp_err_t ret = ESP_OK;
#if (defined CONFIG_IDF_TARGET_ESP32)|| (defined CONFIG_IDF_TARGET_ESP32S2)
    i2s_key_slot[i2s->port].i2s_refcount--;
    if (i2s_key_slot[i2s->port].i2s_refcount > 0) {
        return ret;
    }
#endif // (defined CONFIG_IDF_TARGET_ESP32)|| (defined CONFIG_IDF_TARGET_ESP32S2)
    if (i2s_key_slot[i2s->port].tx_handle) {
        ret |= i2s_channel_disable(i2s_key_slot[i2s->port].tx_handle);
        ret |= i2s_del_channel(i2s_key_slot[i2s->port].tx_handle);
        i2s_key_slot[i2s->port].tx_handle = NULL;
        if (deep_cleanup) {
            i2s_key_slot[i2s->port].dir &= ~I2S_DIR_TX;
        }
    }
    if (i2s_key_slot[i2s->port].rx_handle) {
        ret |= i2s_channel_disable(i2s_key_slot[i2s->port].rx_handle);
        ret |= i2s_del_channel(i2s_key_slot[i2s->port].rx_handle);
        i2s_key_slot[i2s->port].rx_handle = NULL;
        if (deep_cleanup) {
            i2s_key_slot[i2s->port].dir &= ~I2S_DIR_RX;
        }
    }
    return ret;
}

static esp_err_t i2s_config_backup(i2s_stream_cfg_t *i2s_cfg)
{
    int i2s_port = i2s_cfg->chan_cfg.id;
    memcpy(&i2s_key_slot[i2s_port].chan_cfg, &i2s_cfg->chan_cfg, sizeof(i2s_chan_config_t));

    if (i2s_cfg->type == AUDIO_STREAM_READER) {
        if (i2s_cfg->transmit_mode == I2S_COMM_MODE_STD) {
            memcpy(&i2s_key_slot[i2s_port].rx_std_cfg, &i2s_cfg->std_cfg, sizeof(i2s_cfg->std_cfg));
        }
#if SOC_I2S_SUPPORTS_PDM_RX
        else if (i2s_cfg->transmit_mode == I2S_COMM_MODE_PDM) {
            memcpy(&i2s_key_slot[i2s_port].rx_pdm_cfg, &i2s_cfg->pdm_rx_cfg, sizeof(i2s_cfg->pdm_rx_cfg));
        }
#endif // SOC_I2S_SUPPORTS_PDM_RX
#if SOC_I2S_SUPPORTS_TDM
        else if (i2s_cfg->transmit_mode == I2S_COMM_MODE_TDM) {
            memcpy(&i2s_key_slot[i2s_port].rx_tdm_cfg, &i2s_cfg->tdm_cfg, sizeof(i2s_cfg->tdm_cfg));
        }
#endif // SOC_I2S_SUPPORTS_TDM
    } else if (i2s_cfg->type == AUDIO_STREAM_WRITER) {
        if (i2s_cfg->transmit_mode == I2S_COMM_MODE_STD) {
            memcpy(&i2s_key_slot[i2s_port].tx_std_cfg, &i2s_cfg->std_cfg, sizeof(i2s_cfg->std_cfg));
        }
#if SOC_I2S_SUPPORTS_PDM_TX
        else if (i2s_cfg->transmit_mode == I2S_COMM_MODE_PDM) {
            memcpy(&i2s_key_slot[i2s_port].tx_pdm_cfg, &i2s_cfg->pdm_tx_cfg, sizeof(i2s_cfg->pdm_tx_cfg));
        }
#endif // SOC_I2S_SUPPORTS_PDM_TX
#if SOC_I2S_SUPPORTS_TDM
        else if (i2s_cfg->transmit_mode == I2S_COMM_MODE_TDM) {
            memcpy(&i2s_key_slot[i2s_port].tx_tdm_cfg, &i2s_cfg->tdm_cfg, sizeof(i2s_cfg->tdm_cfg));
        }
#endif // SOC_I2S_SUPPORTS_TDM
    } else {
        ESP_LOGE(TAG, "Invalid audio stream type: %d", i2s_cfg->type);
    }
    return ESP_OK;
}

static inline esp_err_t i2s_stream_check_data_bits(i2s_stream_t *i2s, int *bits)
{
    if (i2s->config.transmit_mode == I2S_COMM_MODE_STD) {
#if (defined (CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2))
        if (*bits == I2S_DATA_BIT_WIDTH_24BIT) {
            i2s->config.need_expand = true;
            *bits = I2S_DATA_BIT_WIDTH_32BIT;
            i2s->config.std_cfg.slot_cfg.data_bit_width = I2S_DATA_BIT_WIDTH_32BIT;
            i2s->config.std_cfg.slot_cfg.ws_width = I2S_DATA_BIT_WIDTH_32BIT;
        } else {
            i2s->config.std_cfg.slot_cfg.data_bit_width = *bits;
            i2s->config.std_cfg.slot_cfg.ws_width = *bits;
        }
#else
        if (*bits == I2S_DATA_BIT_WIDTH_24BIT) {
            i2s->config.std_cfg.clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_384;
        }
#endif // (defined (CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2))
    }
    return ESP_OK;
}

static esp_err_t i2s_stream_setup_music_info(audio_element_handle_t el, i2s_stream_t *i2s)
{
    int sample_rate_hz = 0;
    int slot_mode = 0;
    int data_bit_width = 0;
    switch (i2s->config.transmit_mode) {
        case I2S_COMM_MODE_STD:
            sample_rate_hz = i2s->config.std_cfg.clk_cfg.sample_rate_hz;
            slot_mode = i2s->config.std_cfg.slot_cfg.slot_mode;
            data_bit_width = i2s->config.std_cfg.slot_cfg.data_bit_width;
            break;
#if SOC_I2S_SUPPORTS_PDM
        case I2S_COMM_MODE_PDM:
#if SOC_I2S_SUPPORTS_PDM_TX
            if (i2s->type == AUDIO_STREAM_WRITER) {
                sample_rate_hz = i2s->config.pdm_tx_cfg.clk_cfg.sample_rate_hz;
                slot_mode = i2s->config.pdm_tx_cfg.slot_cfg.slot_mode;
                data_bit_width = i2s->config.pdm_tx_cfg.slot_cfg.data_bit_width;
            }
#endif // SOC_I2S_SUPPORTS_PDM_TX
#if SOC_I2S_SUPPORTS_PDM_RX
            if (i2s->type == AUDIO_STREAM_READER) {
                sample_rate_hz = i2s->config.pdm_rx_cfg.clk_cfg.sample_rate_hz;
                slot_mode = i2s->config.pdm_rx_cfg.slot_cfg.slot_mode;
                data_bit_width = i2s->config.pdm_rx_cfg.slot_cfg.data_bit_width;
            }
#endif // SOC_I2S_SUPPORTS_PDM_RX
            break;
#endif
#if SOC_I2S_SUPPORTS_TDM
        case I2S_COMM_MODE_TDM:
            sample_rate_hz = i2s->config.tdm_cfg.clk_cfg.sample_rate_hz;
            slot_mode = i2s->config.tdm_cfg.slot_cfg.slot_mode;
            data_bit_width = i2s->config.tdm_cfg.slot_cfg.data_bit_width;
            break;
#endif
        default:
            sample_rate_hz = i2s->config.std_cfg.clk_cfg.sample_rate_hz;
            slot_mode = i2s->config.std_cfg.slot_cfg.slot_mode;
            data_bit_width = i2s->config.std_cfg.slot_cfg.data_bit_width;
            break;
    }
    i2s_stream_check_data_bits(i2s, &data_bit_width);

    audio_element_set_music_info(el, sample_rate_hz, slot_mode, data_bit_width);
    return ESP_OK;
}

static esp_err_t _i2s_set_clk(i2s_stream_t *i2s, int rate, int bits, int ch)
{
    esp_err_t err = ESP_OK;
    i2s_port_t port = i2s->port;
    i2s_slot_mode_t slot_mode;
    if (ch == 1) {
        slot_mode = I2S_SLOT_MODE_MONO;
    } else if (ch == 2) {
        slot_mode = I2S_SLOT_MODE_STEREO;
    } else {
        ESP_LOGE(TAG, "Invalid ch: %d", ch);
        return ESP_FAIL;
    }
    if (i2s->config.transmit_mode == I2S_COMM_MODE_STD) {
        if (i2s_key_slot[port].tx_handle != NULL && i2s->type == AUDIO_STREAM_WRITER) {
            i2s_key_slot[port].tx_std_cfg.slot_cfg.data_bit_width = bits;
            i2s_key_slot[port].tx_std_cfg.slot_cfg.ws_width = bits;
            i2s_key_slot[port].tx_std_cfg.slot_cfg.slot_mode = slot_mode;
            i2s_key_slot[port].tx_std_cfg.clk_cfg.sample_rate_hz = rate;
            i2s_channel_disable(i2s_key_slot[port].tx_handle);
            err |= i2s_channel_reconfig_std_slot(i2s_key_slot[port].tx_handle, &i2s_key_slot[port].tx_std_cfg.slot_cfg);
            err |= i2s_channel_reconfig_std_clock(i2s_key_slot[port].tx_handle, &i2s_key_slot[port].tx_std_cfg.clk_cfg);
            err |= i2s_channel_enable(i2s_key_slot[port].tx_handle);
        }
        if (i2s_key_slot[port].rx_handle != NULL && i2s->type == AUDIO_STREAM_READER) {
            i2s_key_slot[i2s->port].rx_std_cfg.slot_cfg.data_bit_width = bits;
            i2s_key_slot[i2s->port].rx_std_cfg.slot_cfg.ws_width = bits;
            i2s_key_slot[i2s->port].rx_std_cfg.slot_cfg.slot_mode = slot_mode;
            i2s_key_slot[i2s->port].rx_std_cfg.clk_cfg.sample_rate_hz = rate;
            i2s_channel_disable(i2s_key_slot[port].rx_handle);
            err |= i2s_channel_reconfig_std_slot(i2s_key_slot[port].rx_handle, &i2s_key_slot[i2s->port].rx_std_cfg.slot_cfg);
            err |= i2s_channel_reconfig_std_clock(i2s_key_slot[port].rx_handle, &i2s_key_slot[i2s->port].rx_std_cfg.clk_cfg);
            err |= i2s_channel_enable(i2s_key_slot[port].rx_handle);
        }
#if SOC_I2S_SUPPORTS_PDM
    } else if (i2s->config.transmit_mode == I2S_COMM_MODE_PDM) {
#if SOC_I2S_SUPPORTS_PDM_TX
        if (i2s_key_slot[port].tx_handle != NULL && i2s->type == AUDIO_STREAM_WRITER) {
            i2s_key_slot[i2s->port].tx_pdm_cfg.clk_cfg.sample_rate_hz = rate;
            i2s_key_slot[i2s->port].tx_pdm_cfg.slot_cfg.data_bit_width = bits;
            i2s_key_slot[i2s->port].tx_pdm_cfg.slot_cfg.slot_mode = slot_mode;
            i2s_channel_disable(i2s_key_slot[port].tx_handle);
            err |= i2s_channel_reconfig_pdm_tx_slot(i2s_key_slot[port].tx_handle, &i2s_key_slot[i2s->port].tx_pdm_cfg.slot_cfg);
            err |= i2s_channel_reconfig_pdm_tx_clock(i2s_key_slot[port].tx_handle, &i2s_key_slot[i2s->port].tx_pdm_cfg.clk_cfg);
            err |= i2s_channel_enable(i2s_key_slot[port].tx_handle);
        }
#endif // SOC_I2S_SUPPORTS_PDM_TX
#if SOC_I2S_SUPPORTS_PDM_RX
        if (i2s_key_slot[port].rx_handle != NULL && i2s->type == AUDIO_STREAM_READER) {
            i2s_key_slot[i2s->port].rx_pdm_cfg.clk_cfg.sample_rate_hz = rate;
            i2s_key_slot[i2s->port].rx_pdm_cfg.slot_cfg.data_bit_width = bits;
            i2s_key_slot[i2s->port].rx_pdm_cfg.slot_cfg.slot_mode = slot_mode;
            i2s_channel_disable(i2s_key_slot[port].rx_handle);
            err |= i2s_channel_reconfig_pdm_rx_slot(i2s_key_slot[port].rx_handle, &i2s_key_slot[i2s->port].rx_pdm_cfg.slot_cfg);
            err |= i2s_channel_reconfig_pdm_rx_clock(i2s_key_slot[port].rx_handle, &i2s_key_slot[i2s->port].rx_pdm_cfg.clk_cfg);
            err |= i2s_channel_enable(i2s_key_slot[port].rx_handle);
        }
#endif // SOC_I2S_SUPPORTS_PDM_RX

#endif // SOC_I2S_SUPPORTS_PDM
#if SOC_I2S_SUPPORTS_TDM
    } else if (i2s->config.transmit_mode == I2S_COMM_MODE_TDM) {
        if (i2s_key_slot[port].tx_handle != NULL && i2s->type == AUDIO_STREAM_WRITER) {
            i2s_key_slot[i2s->port].tx_tdm_cfg.clk_cfg.sample_rate_hz = rate;
            i2s_key_slot[i2s->port].tx_tdm_cfg.slot_cfg.data_bit_width = bits;
            i2s_key_slot[i2s->port].tx_tdm_cfg.slot_cfg.ws_width = bits;
            i2s_key_slot[i2s->port].tx_tdm_cfg.slot_cfg.slot_mode = slot_mode;
            i2s_channel_disable(i2s_key_slot[port].tx_handle);
            err |= i2s_channel_reconfig_tdm_slot(i2s_key_slot[port].tx_handle, &i2s_key_slot[i2s->port].tx_tdm_cfg.slot_cfg);
            err |= i2s_channel_reconfig_tdm_clock(i2s_key_slot[port].tx_handle, &i2s_key_slot[i2s->port].tx_tdm_cfg.clk_cfg);
            err |= i2s_channel_enable(i2s_key_slot[port].tx_handle);
        }
        if (i2s_key_slot[port].rx_handle != NULL && i2s->type == AUDIO_STREAM_READER) {
            i2s_key_slot[i2s->port].rx_tdm_cfg.clk_cfg.sample_rate_hz = rate;
            i2s_key_slot[i2s->port].rx_tdm_cfg.slot_cfg.data_bit_width = bits;
            i2s_key_slot[i2s->port].rx_tdm_cfg.slot_cfg.ws_width = bits;
            i2s_key_slot[i2s->port].rx_tdm_cfg.slot_cfg.slot_mode = slot_mode;
            i2s_channel_disable(i2s_key_slot[port].rx_handle);
            err |= i2s_channel_reconfig_tdm_slot(i2s_key_slot[port].rx_handle, &i2s_key_slot[i2s->port].rx_tdm_cfg.slot_cfg);
            err |= i2s_channel_reconfig_tdm_clock(i2s_key_slot[port].rx_handle, &i2s_key_slot[i2s->port].rx_tdm_cfg.clk_cfg);
            err |= i2s_channel_enable(i2s_key_slot[port].rx_handle);
        }
#endif // SOC_I2S_SUPPORTS_TDM
    } else {
        ESP_LOGE(TAG, "Invalid I2S type, %d", i2s->config.transmit_mode);
    }
    return err;
}

