happychriss/ChatGPT_ESP32S3_RealtimeSpeech/components/audio_stream_custom/i2s_stream_idf5_ics43434.c
static int cal_i2s_buffer_timeout(audio_element_handle_t self)
{
#define  DEFAULT_I2S_BUFFER_NUM (2)
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(self);
    int timeout_ms = 0;
    audio_element_info_t stream_info = { 0 };
    audio_element_getinfo(self, &stream_info);
    timeout_ms = i2s->buffer_length * DEFAULT_I2S_BUFFER_NUM / ((stream_info.sample_rates * stream_info.channels * stream_info.bits >> 3) / 1000) ;
    ESP_LOGD(TAG, "I2S buffer timeout: %dms\n", timeout_ms);
    return timeout_ms;
}

static esp_err_t _i2s_open(audio_element_handle_t self)
{
    ESP_LOGD(TAG, "I2S open");
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(self);
    if (i2s->is_open) {
        return ESP_OK;
    }
    if (i2s->type == AUDIO_STREAM_WRITER) {
        audio_element_set_input_timeout(self, pdMS_TO_TICKS(cal_i2s_buffer_timeout(self)));
    }
    i2s->is_open = true;
    if (i2s->use_alc) {
        i2s->volume_handle = alc_volume_setup_open();
        if (i2s->volume_handle == NULL) {
            ESP_LOGE(TAG, "I2S create the handle for setting volume failed, in line(%d)", __LINE__);
            return ESP_FAIL;
        }
    }
    return ESP_OK;
}

static esp_err_t _i2s_destroy(audio_element_handle_t self)
{
    ESP_LOGD(TAG, "I2S destroy");
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(self);
    if (i2s->uninstall_drv) {
        i2s_driver_cleanup(i2s, true);
    }
    if (i2s->expand.buf) {
        audio_free(i2s->expand.buf);
    }
    audio_free(i2s);
    return ESP_OK;
}

static esp_err_t _i2s_close(audio_element_handle_t self)
{
    ESP_LOGD(TAG, "I2S close");
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(self);

    i2s->is_open = false;
    if (AEL_STATE_PAUSED != audio_element_get_state(self)) {
        audio_element_report_pos(self);
        audio_element_set_byte_pos(self, 0);
    }
    if (i2s->use_alc) {
        if (i2s->volume_handle != NULL) {
            alc_volume_setup_close(i2s->volume_handle);
        }
    }
    return ESP_OK;
}

static esp_err_t i2s_channel_write_expand(i2s_stream_t *i2s, const char *src, size_t src_len, int src_bit, int dst_bit, size_t *bytes_written, uint32_t timeout_ms)
{
    int src_bytes = src_bit / 8;
    int dst_bytes = dst_bit / 8;
    int filled_bytes = dst_bytes - src_bytes;
    int target_len = (src_len * dst_bytes) / src_bytes;
    if ((i2s->expand.buf == NULL) || (target_len > i2s->expand.buffer_size)) {
        if (i2s->expand.buf) {
            audio_free(i2s->expand.buf);
        }
        i2s->expand.buf = audio_calloc(1, target_len);
        AUDIO_MEM_CHECK(TAG, i2s->expand.buf, return ESP_ERR_NO_MEM);
        i2s->expand.buffer_size = target_len;
    }
    memset(i2s->expand.buf, 0, target_len);

    size_t k = 0;
    for (size_t i = 0; i < src_len; i += src_bytes) {
        k += filled_bytes;
        memcpy(&i2s->expand.buf[k], (const char *)(src + i), src_bytes);
        k += src_bytes;
    }
    i2s_channel_write(i2s_key_slot[i2s->port].tx_handle, i2s->expand.buf, target_len, bytes_written, timeout_ms);
    return ESP_OK;
}

void print_binary(int32_t value) {
    char binary_str[40]; // 32 bits + 7 spaces + null terminator
    int index = 0;

    for (int i = 31; i >= 0; i--) {
        binary_str[index++] = ((value >> i) & 1) ? '1' : '0';
        if (i % 8 == 0 && i != 0) {
            binary_str[index++] = ' '; // Add a space every 8 bits for readability
        }
    }
    binary_str[index] = '\0'; // Null-terminate the string
    ESP_LOGI(TAG, "%s", binary_str);
}



static int _i2s_read(audio_element_handle_t self, char *buffer, int len, TickType_t ticks_to_wait, void *context)
{

    // prtint input parameter
//    ESP_LOGI(TAG, "I2S read, len=%d, ticks_to_wait=%lu", len, ticks_to_wait);

    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(self);

    size_t bytes_read = 0;
    int32_t *audio_buffer = (int32_t *)heap_caps_malloc(len, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    int16_t *processed_buffer = (int16_t *)heap_caps_malloc(len / 2, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);

    if (!audio_buffer || !processed_buffer) {
        ESP_LOGE(TAG, "Failed to allocate memory for buffers");
        if (audio_buffer) heap_caps_free(audio_buffer);
        if (processed_buffer) heap_caps_free(processed_buffer);
        return ESP_FAIL;
    }

    i2s_safe_lock(s_i2s_tx_mutex[i2s->port]);

    esp_err_t err = i2s_channel_read(i2s_key_slot[i2s->port].rx_handle, audio_buffer, len, &bytes_read, ticks_to_wait);
    // print first 10 samples


    i2s_safe_unlock(s_i2s_tx_mutex[i2s->port]);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "Error reading I2S data: %s", esp_err_to_name(err));
        heap_caps_free(audio_buffer);
        heap_caps_free(processed_buffer);
        return ESP_FAIL;
    }

    if (bytes_read > 0) {
        size_t sample_count = bytes_read / sizeof(int32_t);
        for (size_t i = 0; i < sample_count; i++) {
            processed_buffer[i] = (int16_t)(audio_buffer[i] >> 8);
        }
        memcpy(buffer, processed_buffer, sample_count * sizeof(int16_t));
        bytes_read = sample_count * sizeof(int16_t);
    }

    heap_caps_free(audio_buffer);
    heap_caps_free(processed_buffer);

    /*
    // print first 10 samples from buffer
    for (int i = 0; i < 10; i++) {
        ESP_LOGI(TAG, "Sample %d: %d", i, buffer[i]);
    }
    */


    return bytes_read;
}

static int _i2s_read_standard(audio_element_handle_t self, char *buffer, int len, TickType_t ticks_to_wait, void *context)
{
    ESP_LOGD(TAG, "I2S read");
    size_t bytes_read = 0;
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(self);
    i2s_safe_lock(s_i2s_tx_mutex[i2s->port]);
    i2s_channel_read(i2s_key_slot[i2s->port].rx_handle, buffer, len, &bytes_read, ticks_to_wait);
    i2s_safe_unlock(s_i2s_tx_mutex[i2s->port]);
    return bytes_read;
}

static int _i2s_write(audio_element_handle_t self, char *buffer, int len, TickType_t ticks_to_wait, void *context)
{
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(self);
    size_t bytes_written = 0;
    audio_element_info_t info;
    audio_element_getinfo(self, &info);
    int target_bits = info.bits;
    if (len) {
#ifdef CONFIG_IDF_TARGET_ESP32
        target_bits = I2S_DATA_BIT_WIDTH_32BIT;
#endif
        i2s_safe_lock(s_i2s_rx_mutex[i2s->port]);
        if (i2s->config.need_expand && (target_bits != i2s->config.expand_src_bits)) {
            i2s_channel_write_expand(i2s, buffer, len, i2s->config.expand_src_bits, target_bits,
                                     &bytes_written, ticks_to_wait);
        } else {
            i2s_channel_write(i2s_key_slot[i2s->port].tx_handle, buffer, len, &bytes_written, ticks_to_wait);
        }
        i2s_safe_unlock(s_i2s_rx_mutex[i2s->port]);
    }
    return bytes_written;
}

