happychriss/ChatGPT_ESP32S3_RealtimeSpeech/components/audio_stream_custom/i2s_stream_idf5_ics43434.c
static int _i2s_process(audio_element_handle_t self, char *in_buffer, int in_len)
{

//     ESP_LOGD(TAG, "I2S process, in_len=%d", in_len);

    int w_size = 0;
    int r_size = audio_element_input(self, in_buffer, in_len);
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(self);
    if (r_size == AEL_IO_TIMEOUT) {
        memset(in_buffer, 0x00, in_len);
        r_size = in_len;
        audio_element_multi_output(self, in_buffer, r_size, 0);
        w_size = audio_element_output(self, in_buffer, r_size);
    } else if (r_size > 0) {
        if (i2s->use_alc) {
            audio_element_info_t i2s_info = { 0 };
            audio_element_getinfo(self, &i2s_info);
            alc_volume_setup_process(in_buffer, r_size, i2s_info.channels, i2s->volume_handle, i2s->volume);
        }
        audio_element_multi_output(self, in_buffer, r_size, 0);
        w_size = audio_element_output(self, in_buffer, r_size);
        audio_element_update_byte_pos(self, w_size);
    } else {
        w_size = r_size;
    }
    return w_size;
}

esp_err_t i2s_stream_set_clk(audio_element_handle_t i2s_stream, int rate, int bits, int ch)
{
    esp_err_t err = ESP_OK;
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(i2s_stream);
    audio_element_state_t state = audio_element_get_state(i2s_stream);
    if (state == AEL_STATE_RUNNING) {
        audio_element_pause(i2s_stream);
    }
    i2s_stream_check_data_bits(i2s, &bits);
    i2s_config_backup(&i2s->config);
    if (_i2s_set_clk(i2s, rate, bits, ch) == ESP_FAIL) {
        ESP_LOGE(TAG, "i2s_set_clk failed");
        err = ESP_FAIL;
    } else {
        audio_element_set_music_info(i2s_stream, rate, ch, bits);
    }
    if (state == AEL_STATE_RUNNING) {
        audio_element_resume(i2s_stream, 0, 0);
    }
    return err;
}

esp_err_t i2s_alc_volume_set(audio_element_handle_t i2s_stream, int volume)
{
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(i2s_stream);
    if (i2s->use_alc) {
        i2s->volume = volume;
        return ESP_OK;
    } else {
        ESP_LOGW(TAG, "The ALC don't be used. It can not be set.");
        return ESP_FAIL;
    }
}

esp_err_t i2s_alc_volume_get(audio_element_handle_t i2s_stream, int *volume)
{
    i2s_stream_t *i2s = (i2s_stream_t *)audio_element_getdata(i2s_stream);
    if (i2s->use_alc) {
        *volume = i2s->volume;
        return ESP_OK;
    } else {
        ESP_LOGW(TAG, "The ALC don't be used");
        return ESP_FAIL;
    }
}

audio_element_handle_t i2s_stream_init(i2s_stream_cfg_t *config)
{

    ESP_LOGD(TAG, "i2s_stream_init");
    audio_element_cfg_t cfg = DEFAULT_AUDIO_ELEMENT_CONFIG();
    audio_element_handle_t el = NULL;
    cfg.open = _i2s_open;
    cfg.close = _i2s_close;
    cfg.process = _i2s_process;
    cfg.destroy = _i2s_destroy;
    cfg.task_stack = config->task_stack;
    cfg.task_prio = config->task_prio;
    cfg.task_core = config->task_core;
    cfg.stack_in_ext = config->stack_in_ext;
    cfg.out_rb_size = config->out_rb_size;
    cfg.multi_out_rb_num = config->multi_out_num;
    cfg.tag = "iis";
    config->buffer_len = config->buffer_len > 0 ? config->buffer_len : I2S_STREAM_BUF_SIZE;
    cfg.buffer_len = config->buffer_len;
    if (cfg.buffer_len % I2S_BUFFER_ALINED_BYTES_SIZE) {
        ESP_LOGE(TAG, "The size of buffer must be a multiple of %d, current size is %d", I2S_BUFFER_ALINED_BYTES_SIZE, cfg.buffer_len);
        return NULL;
    }
    int i2s_port = config->chan_cfg.id;
    i2s_dir_t i2s_dir = 0;
    if (i2s_port == I2S_NUM_AUTO) {
        ESP_LOGE(TAG, "Please specify the port number of I2S.");
        return NULL;
    }
    i2s_stream_t *i2s = audio_calloc(1, sizeof(i2s_stream_t));
    AUDIO_MEM_CHECK(TAG, i2s, return NULL);

    i2s->type = config->type;
    i2s->use_alc = config->use_alc;
    i2s->volume = config->volume;
    i2s->uninstall_drv = config->uninstall_drv;
    i2s->port = i2s_port;
    i2s->buffer_length = config->buffer_len;
    if (config->type == AUDIO_STREAM_READER) {
        cfg.read = _i2s_read;
        i2s_dir = I2S_DIR_RX;
    } else if (config->type == AUDIO_STREAM_WRITER) {
        cfg.write = _i2s_write;
        i2s_dir = I2S_DIR_TX;
    }

#if (!defined (CONFIG_IDF_TARGET_ESP32) && !defined (CONFIG_IDF_TARGET_ESP32S2))
    if (config->need_expand && config->transmit_mode == I2S_COMM_MODE_STD) {
        config->std_cfg.slot_cfg.slot_bit_width = config->std_cfg.slot_cfg.data_bit_width;
        config->std_cfg.slot_cfg.data_bit_width = config->expand_src_bits;
    }
#endif // (defined (CONFIG_IDF_TARGET_ESP32) && defined(CONFIG_IDF_TARGET_ESP32S2))
    memcpy(&i2s->config, config, sizeof(i2s_stream_cfg_t));

    el = audio_element_init(&cfg);
    AUDIO_MEM_CHECK(TAG, el, {
        audio_free(i2s);
        return NULL;
    });
    audio_element_setdata(el, i2s);

    i2s_stream_setup_music_info(el, i2s);
    /* backup i2s configure */
    i2s_config_backup(&i2s->config);

    // In order to be compatible with esp32 and esp32s2, the Tx and TRx of i2s channel use the same controller.
    // However, there is a problem that if RX channel is enabled and then TX channel is enabled, RX channel needs to be turned off first,
    // which will cause it to be turned off during rx operation. Therefore, mutex is used for protection and will never be released
    if (i2s_key_slot[i2s_port].i2s_refcount > 0) {
        i2s_safe_lock_create(s_i2s_tx_mutex[i2s_port]);
        i2s_safe_lock_create(s_i2s_rx_mutex[i2s_port]);
    }
    i2s_safe_lock(s_i2s_tx_mutex[i2s_port]);
    i2s_safe_lock(s_i2s_rx_mutex[i2s_port]);
    if (i2s_key_slot[i2s_port].dir) {
        if (i2s_key_slot[i2s_port].dir & i2s_dir) {
            ESP_LOGW(TAG, "I2S(%d) already startup", i2s_dir);
            goto i2s_end;
        } else {
            i2s_driver_cleanup(i2s, false);
        }
    }
    i2s_key_slot[i2s_port].dir |= i2s_dir;

    if (i2s_driver_startup(el, &i2s->config) != ESP_OK) {
        ESP_LOGE(TAG, "I2S stream init failed");
        i2s_safe_unlock(s_i2s_tx_mutex[i2s_port]);
        i2s_safe_unlock(s_i2s_rx_mutex[i2s_port]);
        return NULL;
    }
    if (i2s_key_slot[i2s_port].dir & I2S_DIR_TX) {
        i2s_channel_enable(i2s_key_slot[i2s_port].tx_handle);
    }
    if (i2s_key_slot[i2s_port].dir & I2S_DIR_RX) {
        i2s_channel_enable(i2s_key_slot[i2s_port].rx_handle);
    }

i2s_end:
    i2s_safe_unlock(s_i2s_tx_mutex[i2s_port]);
    i2s_safe_unlock(s_i2s_rx_mutex[i2s_port]);
    i2s_key_slot[i2s_port].i2s_refcount++;
    return el;
}

