happychriss/ChatGPT_ESP32S3_RealtimeSpeech/components/audio_stream_custom/i2s_stream_idf5_ics43434.c
esp_err_t i2s_stream_set_channel_type(i2s_stream_cfg_t *config, i2s_channel_type_t type)
{
    AUDIO_NULL_CHECK(TAG, config != NULL, {return ESP_ERR_INVALID_ARG;});
    switch (type) {
        case I2S_CHANNEL_TYPE_RIGHT_LEFT:
            config->std_cfg.slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;
            config->std_cfg.slot_cfg.slot_mask = I2S_STD_SLOT_BOTH;
            break;
        case I2S_CHANNEL_TYPE_ONLY_RIGHT:
            config->std_cfg.slot_cfg.slot_mode = I2S_SLOT_MODE_MONO;
            config->std_cfg.slot_cfg.slot_mask = I2S_STD_SLOT_RIGHT;
            break;
        case I2S_CHANNEL_TYPE_ONLY_LEFT:
            config->std_cfg.slot_cfg.slot_mode = I2S_SLOT_MODE_MONO;
            config->std_cfg.slot_cfg.slot_mask = I2S_STD_SLOT_LEFT;
            break;
        case I2S_CHANNEL_TYPE_ALL_RIGHT:
            config->std_cfg.slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;
            config->std_cfg.slot_cfg.slot_mask = I2S_STD_SLOT_RIGHT;
            break;
        case I2S_CHANNEL_TYPE_ALL_LEFT:
            config->std_cfg.slot_cfg.slot_mode = I2S_SLOT_MODE_STEREO;
            config->std_cfg.slot_cfg.slot_mask = I2S_STD_SLOT_LEFT;
            break;
    }
    return ESP_OK;
}

esp_err_t i2s_stream_sync_delay(audio_element_handle_t i2s_stream, int delay_ms)
{
    char *in_buffer = NULL;
    audio_element_info_t info = { 0 };
    audio_element_getinfo(i2s_stream, &info);

    if (delay_ms < 0) {
        uint32_t delay_size = (~delay_ms + 1) * ((uint32_t)(info.sample_rates * info.channels * info.bits / 8) / 1000);
        in_buffer = (char *)audio_malloc(delay_size);
        AUDIO_MEM_CHECK(TAG, in_buffer, return ESP_FAIL);
        memset(in_buffer, 0x00, delay_size);
        ringbuf_handle_t input_rb = audio_element_get_input_ringbuf(i2s_stream);
        if (input_rb) {
            rb_write(input_rb, in_buffer, delay_size, 0);
        }
        audio_free(in_buffer);
    } else if (delay_ms > 0) {
        uint32_t drop_size = delay_ms * ((uint32_t)(info.sample_rates * info.channels * info.bits / 8) / 1000);
        in_buffer = (char *)audio_malloc(drop_size);
        AUDIO_MEM_CHECK(TAG, in_buffer, return ESP_FAIL);
        uint32_t r_size = audio_element_input(i2s_stream, in_buffer, drop_size);
        audio_free(in_buffer);

        if (r_size > 0) {
            audio_element_update_byte_pos(i2s_stream, r_size);
        } else {
            ESP_LOGW(TAG, "Can't get enough data to drop.");
            return ESP_FAIL;
        }
    }
    return ESP_OK;
}
#endif
